Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.СвободныеОстатки.Записывать = Истина;
	Для Каждого Строка Из Товары Цикл
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество = Строка.Количество;
	КонецЦикла;
	Движения.СвободныеОстатки.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Остатки.Количество КАК Количество ИЗ РегистрНакопления.СвободныеОстатки.Остатки(&Момент) КАК Остатки";
	Запрос.УстановитьПараметр("Момент", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Результат = Запрос.Выполнить();

КонецПроцедуры
