Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Остатки.КоличествоОстаток КАК Остаток ИЗ РегистрНакопления.СвободныеОстатки.Остатки(, Номенклатура = &Номенклатура И Склад = &Склад) КАК Остатки";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Остаток = ?(Выборка.Следующий(), Выборка.Остаток, 0);

	Если Остаток < Количество Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.СвободныеОстатки.Записывать = Истина;
	Движение = Движения.СвободныеОстатки.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.Склад = Склад;
	Движение.Количество = Количество;

КонецПроцедуры
