&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	Элементы.ТоварыСтавкаНДС.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДанныеНоменклатуры(ТекущиеДанные.Номенклатура, Объект.ВидЦены, Объект.Дата);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеНоменклатуры(Номенклатура, ВидЦены, Дата)
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ЕдиницаИзмерения, СтавкаНДС");
	Результат.Вставить("Цена", ЦенообразованиеСервер.ЦенаНоменклатуры(Номенклатура, ВидЦены, Дата));
	Возврат Результат;
	
КонецФункции
