&Вместо("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Расш1_КаналПродаж) Тогда
		Расш1_КаналПродаж = Справочники.Расш1_КаналыПродаж.КаналПоУмолчанию(Контрагент);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Расш1_КаналПродаж = Справочники.Расш1_КаналыПродаж.Маркетплейс
		И Не ЗначениеЗаполнено(Расш1_НомерЗаказаМаркетплейса) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан номер заказа маркетплейса'"),
			ЭтотОбъект, "Расш1_НомерЗаказаМаркетплейса", , Отказ);
	КонецЕсли;
	
КонецПроцедуры
