Функция ОстаткиПоСкладу(Склад, Дата, СписокНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, ) КАК Остатки
	|ГДЕ
	|	Остатки.Склад = &Склад
	|	И Остатки.Номенклатура В (&СписокНоменклатуры)
	|	И Остатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
