Функция ПечатьТоварнойНакладной(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТоварнаяНакладная";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваров.ПФ_MXL_ТоварнаяНакладная");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапки.Параметры.Заполнить(ДокументСсылка);
		ОбластьШапки.Параметры.ПредставлениеПокупателя = ДокументСсылка.Контрагент.НаименованиеПолное;
		ТабличныйДокумент.Вывести(ОбластьШапки);
		
		Для Каждого СтрокаТовара Из ДокументСсылка.Товары Цикл
			ОбластьСтроки.Параметры.Заполнить(СтрокаТовара);
			ОбластьСтроки.Параметры.Артикул = СтрокаТовара.Номенклатура.Артикул;
			ОбластьСтроки.Параметры.ЕдиницаИзмерения = СтрокаТовара.Номенклатура.ЕдиницаИзмерения.Наименование;
			
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ш.Штрихкод КАК Штрихкод
				|ИЗ РегистрСведений.ШтрихкодыНоменклатуры КАК Ш
				|ГДЕ Ш.Номенклатура = &Номенклатура");
			Запрос.УстановитьПараметр("Номенклатура", СтрокаТовара.Номенклатура);
			Выборка = Запрос.Выполнить().Выбрать();
			ОбластьСтроки.Параметры.Штрихкод = ?(Выборка.Следующий(), Выборка.Штрихкод, "");
			
			ТабличныйДокумент.Вывести(ОбластьСтроки);
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
