&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, Контрагент, Договор, Склад");
		#Вставка
		Расш1_ДатаОтгрузкиПлан = ДанныеЗаполнения.ЖелаемаяДатаОтгрузки;
		Комментарий = СтрШаблон(НСтр("ru = 'Основание: %1'"), ДанныеЗаполнения);
		#КонецВставки
		Для Каждого СтрокаЗаказа Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказа);
			#Удаление
			НоваяСтрока.Скидка = 0;
			#КонецУдаления
		КонецЦикла;
		ЗаказКлиента = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры
