// Общий модуль РаботаСОбъектамиВызовСервера (Сервер, Вызов сервера)

Функция ДанныеОбъектаДляФормы(Ссылка, ИменаРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяТаблицы = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	%1
		|ИЗ
		|	%2 КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка", ИменаРеквизитов, ИмяТаблицы);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;
	Если Выборка.Следующий() Тогда
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
