Функция СледующийНомерПартии(Номенклатура, Склад) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СчетчикиПартий");
	ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.СчетчикиПартий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Номенклатура = Номенклатура;
			МенеджерЗаписи.Склад = Склад;
		КонецЕсли;
		МенеджерЗаписи.ПоследнийНомер = МенеджерЗаписи.ПоследнийНомер + 1;
		МенеджерЗаписи.Записать();
		НомерПартии = МенеджерЗаписи.ПоследнийНомер;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НомерПартии;
	
КонецФункции
