// Отложенный обработчик обновления, версия 2.4.7.15
Процедура ЗаполнитьВидОперацииВозвратов(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Возврат.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК Возврат
	|ГДЕ
	|	Возврат.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозврата.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВидОперации = ?(ЗначениеЗаполнено(ДокументОбъект.ЗаказКлиента),
			Перечисления.ВидыОперацийВозврата.ПоЗаказу,
			Перечисления.ВидыОперацийВозврата.БезЗаказа);
		Если ДокументОбъект.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры
