Процедура ЗагрузитьПакетКонтрагентов(ДанныеПакета) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Для Каждого ДанныеКонтрагента Из ДанныеПакета Цикл
			Попытка
				Ссылка = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ДанныеКонтрагента.ИНН);
				Если Ссылка.Пустая() Тогда
					Объект = Справочники.Контрагенты.СоздатьЭлемент();
				Иначе
					Объект = Ссылка.ПолучитьОбъект();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Объект, ДанныеКонтрагента, "Наименование, ИНН, КПП, ЮридическийАдрес");
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("ОбменССайтом.ЗагрузкаКонтрагентов", УровеньЖурналаРегистрации.Ошибка, , ,
					СтрШаблон("ИНН %1: %2", ДанныеКонтрагента.ИНН, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
