// Используется в РМК перед пробитием чека и в форме закрытия смены.
Функция ЕстьОткрытаяКассоваяСмена(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.КассаККМ = &КассаККМ
	|	И КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|	И КассоваяСмена.Проведен";
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
