&НаСервере
&Вместо("ПриСозданииНаСервере")
Процедура ак_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Перенесено из типовой формы (УТ 11.5.12.87), добавлено поле "Канал продаж".
	// UPD 14.03: убрал вызов печати, у нас своя.
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Элементы.Соглашение.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Элементы.ГруппаЭтапыОплаты.Видимость =
		Объект.ПорядокРасчетов <> Перечисления.ПорядкиРасчетов.ПоНакладным;
	
	Элемент = Элементы.Добавить("ак_КаналПродаж", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	Элемент.ПутьКДанным = "Объект.ак_КаналПродаж";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры
