Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТары");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Тара;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВидТары", "ВидТары");
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	Блокировка.Заблокировать();
	
	Движения.ОстаткиТары.Записывать = Истина;
	Для Каждого СтрокаТары Из Тара Цикл
		Движение = Движения.ОстаткиТары.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.ВидТары = СтрокаТары.ВидТары;
		Движение.Количество = СтрокаТары.Количество;
	КонецЦикла;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Остатки.ВидТары КАК ВидТары,
	|	Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТары.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И ВидТары В (&ВидыТары)) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидыТары", Тара.ВыгрузитьКолонку("ВидТары"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Не хватает возвратной тары %1: %2'"), Выборка.ВидТары, -Выборка.Остаток),
			ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры
