Функция ЗарезервироватьНомерПартии(Производство) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Счетчики.ПоследнийНомер КАК ПоследнийНомер
		|ИЗ
		|	РегистрСведений.СчетчикиПартий КАК Счетчики
		|ГДЕ
		|	Счетчики.Производство = &Производство
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.СчетчикиПартий";
		Запрос.УстановитьПараметр("Производство", Производство);
		Выборка = Запрос.Выполнить().Выбрать();
		НовыйНомер = ?(Выборка.Следующий(), Выборка.ПоследнийНомер, 0) + 1;
		
		МенеджерЗаписи = РегистрыСведений.СчетчикиПартий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Производство = Производство;
		МенеджерЗаписи.ПоследнийНомер = НовыйНомер;
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат СтрШаблон("%1-%2", Формат(ТекущаяДатаСеанса(), "ДФ=yyMM"), Формат(НовыйНомер, "ЧЦ=6; ЧВН=; ЧГ=0"));
	
КонецФункции
