// Отложенный обработчик обновления 3.2.7.15
Процедура ЗаполнитьКаналПродажВЗаказах(Параметры) Экспорт
	
	Выборка = ВыборкаЗаказовБезКанала(1000);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ЗаказКлиента");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.КаналПродаж = КаналПоУмолчанию(ДокументОбъект.Подразделение);
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("Обновление.ЗаполнитьКаналПродаж",
				УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.ЗаказКлиента,
				Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = (Выборка.Количество() = 0);
	
КонецПроцедуры
