Функция ТекстЗапросаНеоплаченныеСчета()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счета.Ссылка КАК Счет,
	|	Счета.Контрагент КАК Контрагент,
	|	Счета.СуммаДокумента КАК СуммаСчета,
	|	ЕСТЬNULL(СУММА(Оплаты.Сумма), 0) КАК Оплачено
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК Оплаты
	|		ПО (Оплаты.СчетНаОплату = Счета.Ссылка)
	|			И (Оплаты.Ссылка.Проведен)
	|			И (Оплаты.Ссылка.Дата <= &ДатаОтчета)
	|ГДЕ
	|	Счета.Проведен
	|	И Счета.Дата МЕЖДУ &НачалоПериода И &ДатаОтчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Счета.Ссылка,
	|	Счета.Контрагент,
	|	Счета.СуммаДокумента
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(СУММА(Оплаты.Сумма), 0) < Счета.СуммаДокумента";
	
КонецФункции
