&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтрокаПоиска = Текст;
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьПоиск");
	
	Если СтрДлина(СокрЛП(Текст)) < 3 И Не ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПоиск", 0.6, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПоиск()
	
	ВыполнитьПоискНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Товары, "НаименованиеПолное", СокрЛП(СтрокаПоиска), ВидСравненияКомпоновкиДанных.Содержит, ,
		ЗначениеЗаполнено(СтрокаПоиска));
	
КонецПроцедуры
