&ИзменениеИКонтроль("РассчитатьСуммуСтроки")
Процедура мп_РассчитатьСуммуСтроки(СтрокаТаблицы, СтруктураДействий)
	
	Если СтрокаТаблицы.Количество = 0 Тогда
		СтрокаТаблицы.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	#Удаление
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество;
	#КонецУдаления
	#Вставка
	СтрокаТаблицы.Сумма = мп_ЦенообразованиеКлиентСервер.СуммаСУчетомКратности(
		СтрокаТаблицы.Цена, СтрокаТаблицы.Количество, СтрокаТаблицы.КратностьУпаковки);
	#КонецВставки
	
	Если СтруктураДействий.Свойство("ПересчитатьСкидку") Тогда
		СтрокаТаблицы.СуммаСкидки = Окр(СтрокаТаблицы.Сумма * СтрокаТаблицы.ПроцентСкидки / 100, 2);
	КонецЕсли;
	
	СтрокаТаблицы.СуммаСНДС = СтрокаТаблицы.Сумма - СтрокаТаблицы.СуммаСкидки;
	
КонецПроцедуры
