Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СебестоимостьТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СебестоимостьОстатки.КоличествоОстаток КАК Количество,
		|	СебестоимостьОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(
		|			&МоментВремени,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК СебестоимостьОстатки";
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		Выборка = Запрос.Выполнить().Выбрать();
		
		СебестоимостьЕдиницы = 0;
		Если Выборка.Следующий() И Выборка.Количество <> 0 Тогда
			СебестоимостьЕдиницы = Выборка.Сумма / Выборка.Количество;
		КонецЕсли;
		
		Движение = Движения.СебестоимостьТоваров.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = СтрокаТовары.Количество;
		Движение.Сумма = Окр(СебестоимостьЕдиницы * СтрокаТовары.Количество, 2);
		
	КонецЦикла;
	
КонецПроцедуры
