Процедура ПересчитатьРейтингПоставщиков() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ПересчетРейтингаПоставщиков);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Очередь.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрСведений.ОчередьПересчетаРейтинга КАК Очередь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ДатаДобавления";
	
	Пока Истина Цикл
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			ОценкаПоставщиков.ЗаписатьРейтинг(Выборка.Поставщик);
			
			Набор = РегистрыСведений.ОчередьПересчетаРейтинга.СоздатьНаборЗаписей();
			Набор.Отбор.Поставщик.Установить(Выборка.Поставщик);
			Набор.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
