// Общий модуль ПодборПерсоналаВызовСервера
// Свойства: Сервер = Истина, ВызовСервера = Истина

#Область ПрограммныйИнтерфейс

// Возвращает значения реквизитов объекта для заполнения карточки кандидата.
// Привилегированный режим нужен, т.к. у рекрутеров нет прав на ФизическиеЛица и Сотрудники.
//
Функция ЗначенияРеквизитовДляКарточки(Ссылка, ИменаРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяТаблицы = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	%1
		|ИЗ
		|	%2 КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка", ИменаРеквизитов, ИмяТаблицы);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура(ИменаРеквизитов);
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
