Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыВРезерве");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ТоварыВРезерве.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Склад = СкладОтправитель;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.ЗаказНаПеремещение = Ссылка;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры
