// Модуль объекта плана обмена ОбменСФилиалами
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если ОтправкаЭлемента <> ОтправкаЭлементаДанных.Авто Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЭлементДанных) = Тип("ДокументОбъект.ЗаказПоставщику")
		Или ТипЗнч(ЭлементДанных) = Тип("ДокументОбъект.ПриобретениеТоваров") Тогда
		
		Если ЭлементДанных.Организация <> Организация Тогда
			Если СозданиеНачальногоОбраза Тогда
				ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
			Иначе
				// документ перевесили на другую организацию, у филиала его быть не должно
				ОтправкаЭлемента = ОтправкаЭлементаДанных.Удалить;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
