Процедура СписатьБонусы(Карта, СуммаСписания, ДокументОснование) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусныеБаллыОстатки.БаллыОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.БонусныеБаллы.Остатки(, КартаЛояльности = &Карта) КАК БонусныеБаллыОстатки";
		Запрос.УстановитьПараметр("Карта", Карта);
		Выборка = Запрос.Выполнить().Выбрать();
		Остаток = ?(Выборка.Следующий(), Выборка.Остаток, 0);
		
		Если Остаток < СуммаСписания Тогда
			ВызватьИсключение НСтр("ru = 'Недостаточно баллов на карте'");
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.БонусныеБаллы");
		ЭлементБлокировки.УстановитьЗначение("КартаЛояльности", Карта);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Набор = РегистрыНакопления.БонусныеБаллы.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументОснование);
		Набор.Прочитать();
		Запись = Набор.ДобавитьРасход();
		Запись.Период = ТекущаяДатаСеанса();
		Запись.КартаЛояльности = Карта;
		Запись.Баллы = СуммаСписания;
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
